# GetValidCategoriesForSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetValidCategoriesForSchedule Method
ViewSchedule Class See Also
---
Gets a list of categories that can be used for a regular schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ICollection<ElementId> GetValidCategoriesForSchedule()
```

Visual Basic
---
```text
Public Shared Function GetValidCategoriesForSchedule As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetValidCategoriesForSchedule()
```

# ### Return Value
The IDs of all valid categories.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace